TODOs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-10 za 15:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jan Hein Hoogstad" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. Who are we?</a>
<ul>
<li><a href="#orgheadline4">1.1. Offcourse</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Mission: Democratize Education</a></li>
<li><a href="#orgheadline2">1.1.2. Online Platform</a></li>
<li><a href="#orgheadline3">1.1.3. Offline Courses and Meetings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline7">2. Who are you?</a>
<ul>
<li><a href="#orgheadline6">2.1. Introductions</a></li>
</ul>
</li>
<li><a href="#orgheadline15">3. Guidelines</a>
<ul>
<li><a href="#orgheadline8">3.1. Stay a beginner</a></li>
<li><a href="#orgheadline9">3.2. Not knowing is not less valuable than knowing</a></li>
<li><a href="#orgheadline10">3.3. Own and even embrace your mistakes</a></li>
<li><a href="#orgheadline11">3.4. Avoid or explain jargon</a></li>
<li><a href="#orgheadline12">3.5. Don't interrupt each other</a></li>
<li><a href="#orgheadline13">3.6. Recapitulate before moving on to your own question</a></li>
<li><a href="#orgheadline14">3.7. Be Nice</a></li>
</ul>
</li>
<li><a href="#orgheadline70">4. Clojure(Script)</a>
<ul>
<li><a href="#orgheadline21">4.1. Parasitic Languages</a>
<ul>
<li><a href="#orgheadline16">4.1.1. Other examples: Scala, Elm, Elixir</a></li>
<li><a href="#orgheadline20">4.1.2. Clojure and Clojurescript</a></li>
</ul>
</li>
<li><a href="#orgheadline53">4.2. Scalars</a>
<ul>
<li><a href="#orgheadline52">4.2.1. Fractions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Emily">Emily</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline56">4.3. Lists</a>
<ul>
<li><a href="#orgheadline55">4.3.1. Clojure versus Lisps</a></li>
</ul>
</li>
<li><a href="#orgheadline59">4.4. Sequences</a>
<ul>
<li><a href="#orgheadline57">4.4.1. Temporality</a></li>
<li><a href="#orgheadline58">4.4.2. Music</a></li>
</ul>
</li>
<li><a href="#orgheadline69">4.5. (Im)mutability</a>
<ul>
<li><a href="#orgheadline63">4.5.1. Vars&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Clay">Clay</span></span></a></li>
<li><a href="#orgheadline67">4.5.2. Persistent Datastructures</a></li>
<li><a href="#orgheadline68">4.5.3. Transients</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Who are we?</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.1</span> Offcourse</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Mission: Democratize Education</h4>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Online Platform</h4>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> Offline Courses and Meetings</h4>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> Who are you?</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> Introductions</h3>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">3</span> Guidelines</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.1</span> Stay a beginner</h3>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.2</span> Not knowing is not less valuable than knowing</h3>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">3.3</span> Own and even embrace your mistakes</h3>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.4</span> Avoid or explain jargon</h3>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.5</span> Don't interrupt each other</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.6</span> Recapitulate before moving on to your own question</h3>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.7</span> Be Nice</h3>
</div>
</div>
<div id="outline-container-orgheadline70" class="outline-2">
<h2 id="orgheadline70"><span class="section-number-2">4</span> Clojure(Script)</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">4.1</span> Parasitic Languages</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">4.1.1</span> Other examples: Scala, Elm, Elixir</h4>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">4.1.2</span> Clojure and Clojurescript</h4>
<div class="outline-text-4" id="text-4-1-2">
</div><ol class="org-ol"><li><a id="orgheadline17"></a>DIfference by host VM<br  /></li>
<li><a id="orgheadline18"></a>Clojure -&gt; Java Virtual Machine<br  /></li>
<li><a id="orgheadline19"></a>ClojureScript -&gt; V8 (or, very rarely, Rhino, Nashhorn, Chakra)<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">4.2</span> Scalars</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-orgheadline52" class="outline-4">
<h4 id="orgheadline52"><span class="section-number-4">4.2.1</span> Fractions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Emily">Emily</span></span></h4>
<div class="outline-text-4" id="text-4-2-1">
</div><ol class="org-ol"><li><a id="orgheadline22"></a><a href="http://stackoverflow.com/questions/1596484/when-i-divide-numbers-in-clojure-i-get-a-fraction-how-do-i-get-the-decimal">Discussion (Stack Overflow)</a><br  /></li>
<li><a id="orgheadline49"></a>Finiteness and Infinite<br  /><ol class="org-ol"><li><a id="orgheadline24"></a>Finite State Machine<br  /><ol class="org-ol"><li><a id="orgheadline23"></a>Computers can only solve problems that are (theoretically) finite<br  /></li></ol></li>
<li><a id="orgheadline29"></a>Rational Numbers<br  /><ol class="org-ol"><li><a id="orgheadline25"></a>All Integers and Fractions<br  /></li>
<li><a id="orgheadline26"></a>1/3<br  /></li>
<li><a id="orgheadline27"></a>Countable<br  /></li>
<li><a id="orgheadline28"></a>Finite<br  /></li></ol></li>
<li><a id="orgheadline34"></a>Irrational Numbers (infinite)<br  /><ol class="org-ol"><li><a id="orgheadline30"></a>All the numbers on the continuous line from -infinity to infinity that cannot be expressed a integers or fractions<br  /></li>
<li><a id="orgheadline31"></a>0.33333333333<br  /></li>
<li><a id="orgheadline32"></a>Uncountable<br  /></li>
<li><a id="orgheadline33"></a>Infinite<br  /></li></ol></li>
<li><a id="orgheadline48"></a>Rounding Errors<br  /><ol class="org-ol"><li><a id="orgheadline36"></a>Banking<br  /><ol class="org-ol"><li><a id="orgheadline35"></a><a href="http://www.xbeat.net/vbspeed/i_BankersRounding.htm">Banker's Rounding</a><br  /></li></ol></li>
<li><a id="orgheadline38"></a>Gambling<br  /><ol class="org-ol"><li><a id="orgheadline37"></a><a href="https://en.wikipedia.org/wiki/Mathematics_of_bookmaking">Mathematics of Bookmaking (Wikipedia)</a><br  /></li></ol></li>
<li><a id="orgheadline47"></a>Music<br  /><ol class="org-ol"><li><a id="orgheadline42"></a>Harmony<br  /><ol class="org-ol"><li><a id="orgheadline39"></a><a href="https://www.youtube.com/watch?v=bhkdyCPYgLs">Rich Hickey on Harmonikit</a><br  /></li>
<li><a id="orgheadline40"></a><a href="http://www.aboutscotland.co.uk/harmony/prop.html">Pythagoras</a><br  /></li>
<li><a id="orgheadline41"></a><a href="https://www.youtube.com/watch?v=Mfsnlbd-4xQ">Functional Composition (Chris Ford)</a><br  /></li></ol></li>
<li><a id="orgheadline46"></a>Noise<br  /><ol class="org-ol"><li><a id="orgheadline43"></a><a href="http://www.inf.fu-berlin.de/lehre/WS01/19548-U/shannon.html">Shannon's Theorem</a><br  /></li>
<li><a id="orgheadline44"></a><a href="https://en.wikipedia.org/wiki/Comparison_of_analog_and_digital_recording#Digital_errors">Digital Errors (Wikipedia)</a><br  /></li>
<li><a id="orgheadline45"></a><a href="https://monoskop.org/images/7/73/Kittler_Friedrich_Gramophone_Film_Typewriter.pdf">Friedrich Kittler, Grammophone, Film, Typewriter</a><br  /></li></ol></li></ol></li></ol></li></ol></li>
<li><a id="orgheadline51"></a>Performance Implications<br  /><ol class="org-ol"><li><a id="orgheadline50"></a><a href="https://github.com/clojure-cookbook/clojure-cookbook/blob/master/01_primitive-data/1-14_working-with-rational-numbers.asciidoc">Working with Rational Numbers</a><br  /></li></ol></li></ol>
</div>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">4.3</span> Lists</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">4.3.1</span> Clojure versus Lisps</h4>
<div class="outline-text-4" id="text-4-3-1">
</div><ol class="org-ol"><li><a id="orgheadline54"></a>Lisp: Only Datastructure<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">4.4</span> Sequences</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-orgheadline57" class="outline-4">
<h4 id="orgheadline57"><span class="section-number-4">4.4.1</span> Temporality</h4>
</div>
<div id="outline-container-orgheadline58" class="outline-4">
<h4 id="orgheadline58"><span class="section-number-4">4.4.2</span> Music</h4>
</div>
</div>
<div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="section-number-3">4.5</span> (Im)mutability</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-orgheadline63" class="outline-4">
<h4 id="orgheadline63"><span class="section-number-4">4.5.1</span> Vars&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Clay">Clay</span></span></h4>
<div class="outline-text-4" id="text-4-5-1">
</div><ol class="org-ol"><li><a id="orgheadline60"></a>Indicated by the reserved word 'def'<br  /></li>
<li><a id="orgheadline61"></a>Can refer to both functions and values<br  /></li>
<li><a id="orgheadline62"></a>Are mutable!!!<br  /></li></ol>
</div>
<div id="outline-container-orgheadline67" class="outline-4">
<h4 id="orgheadline67"><span class="section-number-4">4.5.2</span> Persistent Datastructures</h4>
<div class="outline-text-4" id="text-4-5-2">
</div><ol class="org-ol"><li><a id="orgheadline66"></a>Tries&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Amar">Amar</span></span><br  /><ol class="org-ol"><li><a id="orgheadline64"></a><a href="https://en.wikipedia.org/wiki/Trie">Tries (wikipedia)</a><br  /></li>
<li><a id="orgheadline65"></a><a href="https://www.youtube.com/watch?v=SiFwRtCnxv4">David Nolan on Tries</a><br  /></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline68" class="outline-4">
<h4 id="orgheadline68"><span class="section-number-4">4.5.3</span> Transients</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Hein Hoogstad</p>
<p class="date">Created: 2016-12-10 za 15:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
